backend/app/controllers/players_controller.rb

  def index
    players = Player.all
---
SELECT "players".* FROM "players"

  def create
    binding.pry
    player = Player.new(player_params)

    if player.save
---
INSERT INTO "players" ("name", "position", "number", "hometown", "created_at", "updated_at", "team_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "Test"], ["position", "Forward"], ["number", 5], ["hometown", "Sparta"], ["created_at", "2019-11-07 16:49:41.034446"], ["updated_at", "2019-11-07 16:49:41.034446"], ["team_id", 1]]

  def show
    player = Player.find_by(id: params[:id])
---
SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def set_player
    player = Player.find_by(id: params[:id])
---
SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]