backend/app/controllers/teams_controller.rb

SELECT "teams".* FROM "teams"
---
  def index
    teams = Team.all

INSERT INTO "teams" ("name", "color", "rank", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Mom's Team"], ["color", "Yellow"], ["rank", 3], ["created_at", "2019-11-06 21:23:35.927536"], ["updated_at", "2019-11-06 21:23:35.927536"]]
---
  def create
    team = Team.create!(team_params)

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    team = Team.find_by(id: params[:id])